<?php

/**
 * this is the arabic translation
 */

$data = [
    'title' => 'أحصاء',
    'first_time' => [ // First Time page translation
        'greeting' => 'مرحبًا ، يبدو أن هذه هي المرة الأولى التي نقوم فيها بشيء ما قبل أن نبدأ؟!',
        'room_price' => 'أسعار الغرف',
        'hotel_rooms' => 'غرف الفندق',
        'language' => 'لغة',
        'placeholder' => [
            'single' => 'غرفة بسيطة',
            'dual' => 'غرفة مزدوجة',
            'rooms' => 'غرف الفندق',
            'language' => [
                'choose' => 'اختار',
                'en' => 'الإنجليزية (افتراضي)',
                'fr' => 'فرنسي',
                'ar' => 'عربى'
            ]
        ],
        'submit' => 'أنا مستعد',
        'errors' => [
            'single_required' => 'سعر الغرفة الفردية مطلوب',
            'dual_required' => 'سعر الغرفة المزدوجة مطلوب',
            'rooms_required' => 'رقم الغرف مطلوب',
            'rooms_interval' => 'يجب أن يكون رقم الغرفة أكبر من 20 أقل من 100'
        ]
        ],
        'stats' => [
            'fill' => 'املأ الحقول أدناه',
            'withIncome' => [
                'title' => 'الإحصاء باستخدام الدخل',
                'second_title' => 'إنشاء إحصائية بناءً على دخل الفندق',
                'form' => [
                    'labels' => [
                        'income' => 'دخل الفندق في الشّهر',
                        'host' => 'نسبة الإقامة',
                        'date' => 'التاريخ',
                        'food' => 'نسبة الغذاء',
                        'drink' => 'نسبة الشراب'
                    ],
                    'food' => 'تغذية',
                    'submit' => 'إرسال'
                ]
            ],
            'withnights' => [
                'title' => 'الإحصاء باستخدام الليالي',
                'second_title' => 'إنشاء إحصائية بناءً على الغرف المستأجرة',
                'form' => [
                    'labels' => [
                        'single' => 'غرف فرديّة',
                        'dual' => 'غرف مزدوجة',
                        'host' => 'نسبة الإقامة',
                        'date' => 'التاريخ',
                        'food' => 'نسبة الغذاء',
                        'drink' => 'نسبة الشراب'
                    ],
                    'lengends' => [
                        'nights' => 'الليالي',
                        'food' => 'تغذية',
                    ],
                    'submit' => 'إرسال'
                ],
                'alert' => [
                    'note' => 'تذكير:!',
                    'desc' => 'هذه القيم يمكن أن تكون أرقامًا تقريبية'
                ]
            ],
            'settings' => [
                'change_language' => [
                    'title' => 'تغيير اللغة',
                    'select' => [
                        'title' => 'اللغة',
                        'option' => [
                            'en' => 'الأنجليزي',
                            'fr' => 'فرنسي',
                            'ar' => 'العربية'
                        ]
                    ]
                ],
                'change_hotel_rooms' => [
                    'title' => 'تغيير عدد غرف الفندق',
                    'label' => 'غرف الفندق',
                    'placeholder' => 'مثال: 50'
                ],
                'change_room_prices' => [
                    'title' => 'تغيير أسعار الغرف',
                    'legend' => 'أسعار غرف الفنادق',
                    'single' => 'غرف فرديّة',
                    'dual' => 'غرف مزدوجة'
                ],
                'about' => [
                    'title' => 'حول',
                    'desc' => [
                        'line_one' => 'م إنشاء هذا التطبيق بواسطة علي عمر لمؤسسة Tunvita.',
                        'line_two' => 'تتمثل الوظيفة الرئيسية لهذا في مساعدة مالك الفندق على إجراء محاكاة بسيطة أو إنشاء سجل للأموال المكتسبة لهذا الشهر',
                        'line_three' => 'يعتمد التطبيق على الوظائف الحسابية ومعادلات الإحصاء ، لذا فإن النتيجة التي تحصل عليها ربما لا تكون مثالية ولكنها ستمنحك فكرة ومساعدة كبيرة.'
                    ],
                ],
                'report_bug' => 'تبليغ عن مشكلة',
                'continue' => 'متابعة'
            ],
            'tables' => [
                'month' => [
                    'total' => 'إجمالي',
                    'income' => 'الدخل الشهري',
                    'nights' => 'الليالي الشهرية',
                    'host' => 'استضافة شهرية'
                ],
                'data_table' => [
                    'day_n' => 'اليوم الـ ',
                    'day' => 'يوم',
                    'days' => 'الأيّام',
                    'income' => 'الدخل',
                    'nights' => 'الليالي',
                    'single' => 'غرف فردية',
                    'dual' => 'غرف مزدوجة',
                    'nutrition' => 'التغذية',
                    'drink' => 'شرب',
                    'food' => 'طعام',
                    'download' => 'تحميل بصيغة PDF'
                ],
                'home' => 'الصفحة الرئيسية'
            ]
        ]
];

